---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutsideWall
source: html/06c715b9-3ce6-d927-56e2-548ef0c34762.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutsideWall Property

Curtain wall grid lines are outside wall. If you are trying to shorten the wall, please remove grid lines, including mullions on top of them.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridOutsideWall { get; }
```